Revit 2016 API
BoundaryConditions.AssociatedLoad Property
Retrieve the AssociatedLoad.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
[ObsoleteAttribute("This property is obsolete in Revit 2016. Use AssociatedLoadId property instead.")]
public Element AssociatedLoad { get; }
Visual Basic
<ObsoleteAttribute("This property is obsolete in Revit 2016. Use AssociatedLoadId property instead.")> _
Public ReadOnly Property AssociatedLoad As Element
	Get
Visual C++
[ObsoleteAttribute(L"This property is obsolete in Revit 2016. Use AssociatedLoadId property instead.")]
public:
property Element^ AssociatedLoad {
	Element^ get ();
}
See Also
BoundaryConditions Class
Autodesk.Revit.DB.Structure Namespace